In [1]:
import pandas as pd

In [2]:
num_list = [1,2,3,4,5]    #SERIES
series = pd.Series(num_list)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:

import numpy as np  #Series using an array
arr = np.array([1,2,3,4,5])   
series = pd.Series(arr, index =['a','b','c','d','e'])   #Adding index
print(series)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
data = {'A':20, 'B':30, 'C':40, 'D':50, 'E':60} #Dictionary
series = pd.Series(data)
print(series)

A    20
B    30
C    40
D    50
E    60
dtype: int64

In [5]:
print(series['A']) #Indexing

20

In [6]:
series['A':'C'] #Slicing

A    20
B    30
C    40
dtype: int64

In [7]:
series_1 = pd.Series([1,2,3,4,5]) #Arithematic Operations

series_2 = pd.Series([6,7,8,9,10])

sum_series = series_1 + series_2

sum_series

0     7
1     9
2    11
3    13
4    15
dtype: int64

In [21]:
series_1 = pd.Series([1,2,3,4,5])

series_2 = pd.Series([6,7,8,9,10])

sub_series = series_2 - series_1

sub_series

0    5
1    5
2    5
3    5
4    5
dtype: int64

In [22]:
sum_series[sum_series>10]

2    11
3    13
4    15
dtype: int64

In [ ]:
sum_series[(sum_series>10) & (sum_series<15)] # AND

2    11
3    13
dtype: int64

In [24]:
sum_series[(sum_series>10) | (sum_series<15)] # OR

0     7
1     9
2    11
3    13
4    15
dtype: int64

In [28]:
data = {                                                                  # DataFrame
    "Name":["Aryam","Aavash","Bibek","Sujan","Samyak"],
    "Age":[20,21,22,23,24],
    "City":["Lalitpur","Hetauda","Tanahu","Bhaktapur","Machhegaun"]
}
df = pd.DataFrame(data)

print(df)
df

     Name  Age        City
0   Aryam   20    Lalitpur
1  Aavash   21     Hetauda
2   Bibek   22      Tanahu
3   Sujan   23   Bhaktapur
4  Samyak   24  Machhegaun

     Name  Age        City
0   Aryam   20    Lalitpur
1  Aavash   21     Hetauda
2   Bibek   22      Tanahu
3   Sujan   23   Bhaktapur
4  Samyak   24  Machhegaun

In [29]:
df.head(3)  # Aagadi ko 3

     Name  Age      City
0   Aryam   20  Lalitpur
1  Aavash   21   Hetauda
2   Bibek   22    Tanahu

In [30]:
df.tail(3) #Paxadi ko 3

     Name  Age        City
2   Bibek   22      Tanahu
3   Sujan   23   Bhaktapur
4  Samyak   24  Machhegaun

In [47]:
df = pd.read_csv('C:/Users/aryam/OneDrive/Desktop/ML/data/data.csv') # / THIS FILE FORMAT

In [ ]:
df['Age']  # Spacing in csv file can give error

0    20
1    21
2    22
Name: Age, dtype: int64

In [49]:
df[["Name","Age"]]

     Name  Age
0   Aryam   20
1  Aavash   21
2   Bibek   22

In [50]:
df.loc[1:2,['Age']]

   Age
1   21
2   22

In [51]:
df.iloc[0:2,1]

0    20
1    21
Name: Age, dtype: int64

In [52]:
df[["Marks"]]

   Marks
0    100
1      0
2   -100

In [55]:
df.loc[1:2,['Marks']]

   Marks
1      0
2   -100

In [56]:
df.iloc[0:2:1]

     Name  Age  Marks
0   Aryam   20    100
1  Aavash   21      0

In [60]:
df[(df['Marks']>80) | (df['Age']>21)]

    Name  Age  Marks
0  Aryam   20    100
2  Bibek   22   -100

In [61]:
df

     Name  Age  Marks
0   Aryam   20    100
1  Aavash   21      0
2   Bibek   22   -100

In [62]:
df['Salary'] = [10000,30000,50000]

In [63]:
df

     Name  Age  Marks  Salary
0   Aryam   20    100   10000
1  Aavash   21      0   30000
2   Bibek   22   -100   50000

In [69]:
df[(df['Salary']==30000) & (df['Age']<22) & (df['Marks']<50)]

     Name  Age  Marks  Salary
1  Aavash   21      0   30000

In [71]:
df.dtypes

Name      object
Age        int64
Marks      int64
Salary     int64
dtype: object

In [77]:
print(df[['Age','Marks','Salary']].mean()) # Data Aggregation

print(df[['Age','Marks','Salary']].max())

print(df[['Age','Marks','Salary']].min())

print(df[['Age','Marks','Salary']].median())

Age          21.0
Marks         0.0
Salary    30000.0
dtype: float64
Age          22
Marks       100
Salary    50000
dtype: int64
Age          20
Marks      -100
Salary    10000
dtype: int64
Age          21.0
Marks         0.0
Salary    30000.0
dtype: float64

In [3]:

import pandas as pd
data = {
    "name": ['Aryam','Aavash','Nahakul','Bibek'],
    "age": [20,30,40,50],
    "city": ['Lalitpur', 'Bhaktapur', 'Kathmandu', 'Tanahun'],
    "salary": [10000,20000,30000,40000]
}
df = pd.DataFrame(data)
df

      name  age       city  salary
0    Aryam   20   Lalitpur   10000
1   Aavash   30  Bhaktapur   20000
2  Nahakul   40  Kathmandu   30000
3    Bibek   50    Tanahun   40000

In [4]:
df.groupby('city')['name'].count()

city
Bhaktapur    1
Kathmandu    1
Lalitpur     1
Tanahun      1
Name: name, dtype: int64